const characterData = [
  {
    name: "赵玖",
    yearOfBirth: "1107",
    position: {
      0: ["可达鸭"],
    },
  },
  {
    name: "韩世忠",
    yearOfBirth: "1090",
    position: {
      0: ["御营左军统制", "定国军承宣使"],
      1127110000: ["御营左军权统制"],
      1128020900: ["淮西四郡制置使", "御营左军都统制", "武成军节度使"],
      1129022300: ["淮西四郡制置使", "御营左军都统制", "两镇节度使", "少保"],
      1130060300: [
        "延安郡王",
        "御营左军都统制",
        "泰宁、武安、宁国三镇节度使",
        "少师",
      ],
    },
  },
  {
    name: "杨沂中",
    yearOfBirth: "1102",
    position: {
      0: ["閤门祗候"],
      1128030002: ["御前班直统制"],
      1128040000: ["御前班直统制", "提举皇城司"],
    },
  },
  {
    name: "岳飞",
    yearOfBirth: "1103",
    position: {
      0: ["王彦部统制"],
      1127100000: ["领兵独走东京"],
      1128010000: ["东京留守司统制", "武功郎"],
      1128013000: ["广济、济州镇抚使"],
      1129022300: ["御营前军都统制", "节度使"],
    },
  },
  {
    name: "李彦仙",
    yearOfBirth: "1095",
    position: {
      0: ["陕州知州"],
      1128040002: ["永兴军路经略安抚使"],
      1129022300: ["永兴军路经略安抚使", "御营中军都统制", "兴宁军节度使"],
      1130060300: ["御营中军都统制", "兴宁军节度使"],
    },
  },
  {
    name: "吴玠",
    yearOfBirth: "1093",
    position: {
      0: ["泾原路兵马都监", "知怀德军", "武义郎"],
      1130061501: ["御营后军都统制"],
    },
  },
  {
    name: "曲端",
    yearOfBirth: "1091",
    position: {
      0: ["泾原路统制官", "知延安府"],
      1130061501: ["御营骑军都统"],
    },
  },
  {
    name: "张荣",
    position: {
      0: ["水泊梁山大当家"],
      1128013000: ["东平州镇抚使"],
    },
  },
  {
    name: "张俊",
    yearOfBirth: "1086",
    position: {
      0: ["徐州观察使", "御营后军统制"],
      1128020900: ["淮东五郡制置使", "御营右军都统制", "定江节度使"],
      1129022300: ["淮东五郡制置使", "御营右军都统制", "定江节度使", "少保"],
      1130060300: ["御营右军都统制", "两镇节度使", "少保"],
    },
  },
  {
    name: "王彦",
    yearOfBirth: "1087+",
    position: {
      0: ["张所部都统制"],
      1128010000: ["河北制置使"],
      1129022300: ["河北制置使", "节度使"],
      1129022500: ["御营中军副都统制", "节度使"],
      1130080000: ["秦凤路经略使"],
      1132080000: ["御营都统制", "枢密院都承旨", "枢密院参军事"],
    },
  },
  {
    name: "马扩",
    position: {
      0: ["北道都总管"],
      1129022300: ["北道都总管", "节度使"],
    },
  },
  {
    name: "王德",
    yearOfBirth: "1087",
    position: {
      0: ["刘光世部"],
      1127120000: ["御营统制"],
      1128020900: ["御营中军副都统制"],
      1128121900: ["御营中军副都统制", "南阳四壁防御使"],
      1129022500: ["御营中军副都统制", "开封四壁防御使"],
    },
  },
  {
    name: "吕好问",
    yearOfBirth: "1064",
    position: {
      0: ["知宣州", "资政殿学士"],
      1127080004: ["尚书右丞"],
      1127110002: ["尚书左丞"],
      1128030002: ["都省宰相"],
      1130080000: ["平章军国重事"],
    },
  },
  {
    name: "赵鼎",
    yearOfBirth: "1085",
    position: {
      0: ["权户部员外郎"],
      1127080004: ["殿中侍御史"],
      1128010100: ["寿州知州"],
      1128020900: ["淮南两路转运使"],
      1130090000: ["都省宰相"],
    },
  },
  {
    name: "张浚",
    yearOfBirth: "1097",
    position: {
      0: ["殿中侍御史"],
      1127080004: ["御史中丞"],
      1128020000: ["试御史中丞"],
      1128060001: ["巴蜀五路转运使"],
      1130080000: ["翰林学士"],
      1130090000: ["枢密使"],
    },
  },
  {
    name: "胡寅",
    yearOfBirth: "1098",
    position: {
      0: ["起居郎"],
      1127080004: ["中书舍人"],
      1128020000: ["殿中侍御史"],
      1128060001: ["御史中丞"],
      1130080000: ["关西五路转运使"],
      1132080000: ["工部尚书"],
    },
  },
  {
    name: "林景默",
    position: {
      0: ["寿州知州"],
      1128010400: ["翰林（玉堂）学士", "知制诰"],
      1130080000: ["成都路经略使"],
      1132080000: ["户部尚书"],
    },
  },
  {
    name: "陈规",
    yearOfBirth: "1072",
    position: {
      0: ["直龙图阁领德安知府"],
      1129022300: ["兵部尚书", "开封府尹"],
      1129022301: ["同知枢密院事", "兵部尚书", "开封府尹"],
      1130090000: ["枢密副使"],
    },
  },
  {
    name: "阎孝忠",
    position: {
      0: ["唐州知州"],
      1128030002: ["权知南阳府"],
      1130090000: ["开封府尹"],
    },
  },
  {
    name: "刘汲",
    yearOfBirth: "1083+",
    position: {
      0: ["京西南转运使", "龙图阁直学士"],
      1128030002: ["京西南转运使", "知襄州"],
      1128032000: ["京西南路经略安抚使", "都省副相", "知襄州"],
      1130090000: ["都省副相"],
    },
  },
  {
    name: "李光",
    yearOfBirth: "1078",
    position: {
      0: ["殿中侍御史"],
    },
  },
  { name: "陈公辅", yearOfBirth: "1076" },
  {
    name: "宇文虚中",
    yearOfBirth: "1079",
    position: {
      0: ["资政殿大学士"],
      1127120000: ["同知枢密院事", "资政殿大学士"],
      1128030002: ["枢密副使", "资政殿大学士"],
      1128060002: ["关中使相", "枢密副使", "资政殿大学士"],
    },
  },
  {
    name: "吕颐浩",
    yearOfBirth: "1071",
    position: {
      0: ["工部尚书"],
      1128060002: ["枢密副使"],
      1129022500: ["枢密使"],
      1129030002: ["东南使相"],
      1130090000: ["两浙路经略使"],
    },
  },
  {
    name: "刘子羽",
    yearOfBirth: "1097+",
    position: {
      0: ["兵部判职方司事", "参赞御前军事"],
      1128120000: ["枢密院都承旨", "兵部判职方司事", "参赞御前军事"],
      1130080000: ["利州路经略使"],
      1132080000: ["兵部尚书"],
    },
  },
  {
    name: "万俟卨",
    yearOfBirth: "1083",
    position: {
      0: ["枢密院副承旨"],
    },
  },
  {
    name: "胡闳休",
    position: {
      0: ["枢密院编修"],
    },
  },
  { name: "虞允文", yearOfBirth: "1110" },
  { name: "胡铨", yearOfBirth: "1102" },
  {
    name: "李纲",
    yearOfBirth: "1083",
    position: {
      0: ["观文殿大学士"],
      1127080004: ["尚书左仆射兼门下侍郎", "观文殿大学士"],
      1128010400: ["平章军国重事", "观文殿大学士"],
      1128040000: ["平章军国重事", "使相", "观文殿大学士"],
    },
  },
  {
    name: "宗泽",
    yearOfBirth: "1060",
    position: {
      0: ["天下兵马大元帅府副帅", "东京留守", "枢密使"],
      1129022300: ["谥忠武", "追封王爵"],
    },
  },
  {
    name: "汪伯彦",
    yearOfBirth: "1069",
    position: {
      0: ["知枢密院事"],
      1127080004: ["同知枢密院事"],
      1128030002: ["枢密副使"],
    },
  },
  {
    name: "王渊",
    yearOfBirth: "1077",
    position: {
      0: ["御营都统制"],
      1132080000: ["枢密院副使，荣休"],
    },
  },
  {
    name: "郦琼",
    yearOfBirth: "1104",
    position: {
      0: ["御营中军统制"],
      1130080000: ["御营中军右副都统制"],
    },
  },
  {
    name: "李世辅",
    yearOfBirth: "1109",
    position: {
      0: ["南阳开国公"],
      1130061501: ["御营骑军副都统制"],
    },
  },
  {
    name: "刘錡",
    yearOfBirth: "1098",
    position: {
      0: ["兴元府兵马都监"],
      1130061501: ["御营骑军副都统制"],
    },
  },
  {
    name: "刘晏",
    yearOfBirth: "1098+",
    position: {
      0: ["赤心队首领", "通直郎"],
      1128030002: ["御前班直副统制"],
    },
  },
  {
    name: "挞懒",
    position: {
      0: ["金国都元帅府元帅左监军", "东路军副帅"],
      1128060002: ["金国都元帅府右副元帅"],
    },
  },
  {
    name: "兀术",
    yearOfBirth: "1102+",
    position: {
      0: ["东路军先锋"],
      1128060002: ["金国都元帅府元帅左监军"],
    },
  },
  {
    name: "粘罕",
    yearOfBirth: "1080",
    position: {
      0: ["金国都元帅府左副元帅"],
      1128060002: ["金国都元帅"],
    },
  },
  {
    name: "讹里朵",
    yearOfBirth: "1080",
    position: {
      0: ["金国都元帅府右副元帅"],
      1128060002: ["金国都元帅府左副元帅"],
    },
  },
  {
    name: "赵佶",
    yearOfBirth: "1082",
    position: {
      0: ["太上道君皇帝", "宋徽宗"],
    },
  },
  {
    name: "赵桓",
    yearOfBirth: "1100",
    position: {
      0: ["太上渊圣皇帝", "宋钦宗"],
    },
  },
  {
    name: "赵构",
    yearOfBirth: "1107",
    position: {
      0: ["完颜构", "史实位面宋高宗"],
    },
  },
  {
    name: "张邦昌",
    yearOfBirth: "1081",
    position: {
      0: ["伪楚皇帝"],
    },
  },
  {
    name: "康履",
    position: {
      0: ["内侍省大押班"],
    },
  },
  {
    name: "黄潜善",
    yearOfBirth: "1078",
    position: {
      0: ["都省宰相（东府相公）"],
      1127080004: ["提举杭州洞霄宫"],
    },
  },
  {
    name: "梁扬祖",
    yearOfBirth: "1080",
    position: {
      0: [
        "集英殿修撰",
        "徽猷阁待制",
        "扬州知州",
        "江淮等路制置发运使",
        "领东南茶盐事",
      ],
      1130080000: ["工部尚书"],
      1132080000: ["都省副相，荣休"],
    },
  },
  {
    name: "许景衡",
    yearOfBirth: "1072",
    position: {
      0: ["尚书右丞", "同参知政事"],
      1128030002: ["都省副相"],
      1130090000: ["荣休", "丹阳郡王"],
    },
  },
  {
    name: "张悫",
    yearOfBirth: "1065",
    position: {
      0: ["户部尚书", "措置户部财用兼御营副使", "同知枢密院事"],
      1128030002: ["枢密副使"],
    },
  },
  {
    name: "张所",
    position: {
      0: ["河北西路招抚使（罢）", "龙图阁直学士"],
      1127100001: ["山东留守", "龙图阁直学士"],
      1128020900: ["京东两路制置使", "龙图阁直学士"],
      1128040000: ["京东两路制置使", "资政殿大学士"],
    },
  },
  {
    name: "刘光世",
    yearOfBirth: "1086",
    position: {
      0: [
        "御营使司提举一行事务",
        "京东东路六州军界制置使",
        "行在都巡检使",
        "奉国军节度使",
      ],
    },
  },
  {
    name: "刘洪道",
    position: {
      0: ["青州知州"],
      1128010000: ["江南西路置制使"],
      1131010000: ["江西路经略使"],
      1132080000: ["兵部侍郎", "兼判都水监"],
    },
  },
  {
    name: "马伸",
    position: {
      0: ["殿中侍御史"],
      1128010000: ["荆湖北路制置使"],
      1131010000: ["湖北路经略使"],
      1132080000: ["刑部尚书"],
    },
  },
  {
    name: "杨惟忠",
    position: {
      0: ["北道都总管", "建武军节度使"],
      1128013000: ["总揽殿前司公事", "建武军节度使"],
      1128030002: ["御营副都统制", "建武军节度使"],
      1128060002: ["御营后军都统制", "建武军节度使"],
    },
  },
  {
    name: "闾勍",
    position: {
      0: ["三衙步帅"],
      1128030002: ["御营副都统制"],
    },
  },
  {
    name: "牛皋",
    yearOfBirth: "1087",
    position: {
      0: ["保义郎小使臣"],
      1129022300: ["统制官"],
    },
  },
  {
    name: "杜充",
    yearOfBirth: "1069+",
    position: {
      0: ["开封府尹"],
      1128120000: ["东京副留守"],
    },
  },
  {
    name: "郭仲荀",
    position: {
      0: ["东京留守司推官"],
    },
  },
  {
    name: "赵开",
    yearOfBirth: "1065",
    position: {
      0: ["成都路转运判官"],
      1130080000: [
        "关陕巴蜀九路转运判官",
        "都大提举九路茶盐公事",
        "提举沿边买马监牧公事",
      ],
      1132080000: ["秦凤路经略使"],
    },
  },
  {
    name: "吕祉",
    yearOfBirth: "1092",
    position: {
      0: ["知江宁府"],
      1130090000: ["吏部侍郎"],
    },
  },
  {
    name: "胡世将",
    yearOfBirth: "1085",
    position: {
      0: ["知镇江府"],
      1130090000: ["兵部尚书"],
      1132080000: ["陕西路经略使"],
    },
  },
  {
    name: "林杞",
    position: {
      0: ["户部尚书"],
      1132080000: ["利州路经略使"],
    },
  },
  {
    name: "王庶",
    position: {
      0: ["鄜延路经略使", "知延安府"],
      1129081000: ["刑部尚书"],
      1132080000: ["成都路经略使"],
    },
  },
];

export default characterData;
