const characterData = [
  {
    name: "赵玖",
    yearOfBirth: "1107",
    position: {
      0: ["可达鸭"],
    },
  },
  {
    name: "韩世忠",
    yearOfBirth: "1090",
    position: {
      0: ["御营左军统制", "定国军承宣使"],
      1127110000: ["御营左军权统制"],
      1128020900: ["淮西四郡制置使", "御营左军都统制", "武成军节度使"],
      1129022300: ["淮西四郡制置使", "御营左军都统制", "两镇节度使", "少保"],
      1130060300: [
        "延安郡王",
        "御营左军都统制",
        "泰宁、武安、宁国三镇节度使",
        "少师",
      ],
    },
  },
  {
    name: "杨沂中",
    yearOfBirth: "1102",
    position: {
      0: ["閤门祗候"],
    },
  },
  {
    name: "岳飞",
    yearOfBirth: "1103",
    position: {
      0: ["王彦部统制"],
      1127100000: ["领兵独走东京"],
      1128010000: ["东京留守司统制", "正阶武功郎"],
      1128013000: ["广济、济州镇抚使"],
    },
  },
  { name: "李彦仙", yearOfBirth: "1095" },
  { name: "吴玠", yearOfBirth: "1093" },
  { name: "曲端", yearOfBirth: "1091" },
  {
    name: "张荣",
    position: {
      0: ["水泊梁山大当家"],
      1128013000: ["东平州镇抚使"],
    },
  },
  {
    name: "张俊",
    yearOfBirth: "1086",
    position: {
      0: ["徐州观察使", "御营后军统制"],
      1128020900: ["淮东五郡制置使", "御营右军都统制", "定江节度使"],
      1129022300: ["淮东五郡制置使", "御营右军都统制", "定江节度使", "少保"],
    },
  },
  {
    name: "王彦",
    yearOfBirth: "1087+",
    position: {
      0: ["张所部（后为太行山八字军）都统制", "河北制置使"],
    },
  },
  {
    name: "马扩",
    position: {
      0: ["北道都总管"],
    },
  },
  {
    name: "王德",
    yearOfBirth: "1087",
    position: {
      0: ["刘光世部"],
      1127120000: ["御营统制"],
      1128020900: ["御营中军副都统制"],
    },
  },
  {
    name: "吕好问",
    yearOfBirth: "1064",
    position: {
      0: ["知宣州", "资政殿学士"],
      1127080004: ["尚书右丞"],
      1127110002: ["尚书左丞"],
    },
  },
  {
    name: "赵鼎",
    yearOfBirth: "1085",
    position: {
      0: ["权户部员外郎"],
      1127080004: ["殿中侍御史"],
      1128010100: ["寿州知州"],
      1128020900: ["淮南两路转运使"],
    },
  },
  {
    name: "张浚",
    yearOfBirth: "1097",
    position: {
      0: ["殿中侍御史"],
      1127080004: ["御史中丞"],
    },
  },
  {
    name: "胡寅",
    yearOfBirth: "1098",
    position: {
      0: ["起居郎"],
      1127080004: ["中书舍人"],
    },
  },
  {
    name: "林景默",
    position: {
      0: ["寿州知州"],
      1128010400: ["翰林（玉堂）学士", "知制诰"],
    },
  },
  { name: "陈规", yearOfBirth: "1072" },
  { name: "刘汲", yearOfBirth: "1083" },
  { name: "李光", yearOfBirth: "1078" },
  { name: "陈公辅", yearOfBirth: "1076" },
  {
    name: "宇文虚中",
    yearOfBirth: "1079",
    position: {
      0: ["资政殿大学士"],
      1127120000: ["同知枢密院事", "资政殿大学士"],
    },
  },
  { name: "吕颐浩", yearOfBirth: "1071" },
  { name: "刘子羽", yearOfBirth: "1097" },
  { name: "虞允文", yearOfBirth: "1110" },
  { name: "胡铨", yearOfBirth: "1102" },
  {
    name: "李纲",
    yearOfBirth: "1083",
    position: {
      0: ["观文殿大学士"],
      1127080004: ["尚书左仆射兼门下侍郎（宰相）", "观文殿大学士"],
    },
  },
  {
    name: "宗泽",
    yearOfBirth: "1060",
    position: {
      0: ["元帅府副帅", "东京留守"],
    },
  },
  {
    name: "汪伯彦",
    yearOfBirth: "1069",
    position: {
      0: ["知枢密院事（西府相公，枢相）"],
      1127080004: ["同知枢密院事（西府相公，枢相）"],
    },
  },
  {
    name: "王渊",
    yearOfBirth: "1077",
    position: {
      0: ["御营都统制"],
    },
  },
  { name: "郦琼", yearOfBirth: "1104" },
  { name: "李世辅", yearOfBirth: "1109" },
  { name: "刘錡", yearOfBirth: "1098" },
  {
    name: "刘晏",
    yearOfBirth: "1098+",
    position: {
      0: ["赤心队首领", "通直郎"],
    },
  },
  {
    name: "挞懒",
    position: {
      0: ["金国东路军监军副帅"],
    },
  },
  {
    name: "兀术",
    yearOfBirth: "1102+",
    position: {
      0: ["金国东路军先锋"],
    },
  },
  {
    name: "赵佶",
    yearOfBirth: "1082",
    position: {
      0: ["太上道君皇帝", "宋徽宗"],
    },
  },
  {
    name: "赵桓",
    yearOfBirth: "1100",
    position: {
      0: ["太上渊圣皇帝", "宋钦宗"],
    },
  },
  {
    name: "赵构",
    yearOfBirth: "1107",
    position: {
      0: ["完颜构", "史实位面宋高宗"],
    },
  },
  {
    name: "张邦昌",
    yearOfBirth: "1081",
    position: {
      0: ["伪楚皇帝"],
    },
  },
  {
    name: "康履",
    position: {
      0: ["内侍省大押班"],
    },
  },
  {
    name: "黄潜善",
    yearOfBirth: "1078",
    position: {
      0: ["都省宰相（东府相公）"],
      1127080004: ["提举杭州洞霄宫"],
    },
  },
  {
    name: "梁扬祖",
    yearOfBirth: "1080",
    position: {
      0: [
        "集英殿修撰",
        "徽猷阁待制",
        "扬州知州",
        "江淮等路制置发运使",
        "领东南茶盐事",
      ],
    },
  },
  {
    name: "许景衡",
    yearOfBirth: "1072",
    position: {
      0: ["尚书右丞", "同参知政事"],
    },
  },
  {
    name: "张悫",
    yearOfBirth: "1065",
    position: {
      0: ["户部尚书", "措置户部财用兼御营副使", "同知枢密院事"],
    },
  },
  {
    name: "张所",
    position: {
      0: ["河北西路招抚使（罢）", "龙图阁直学士"],
      1127100001: ["山东留守", "龙图阁直学士"],
      1128020900: ["京东两路制置使", "龙图阁直学士"],
    },
  },
  {
    name: "刘光世",
    yearOfBirth: "1086",
    position: {
      0: [
        "御营使司提举一行事务",
        "京东东路六州军界制置使",
        "行在都巡检使",
        "奉国军节度使",
      ],
    },
  },
  {
    name: "刘洪道",
    position: {
      0: ["青州知州"],
      1128010000: ["江南西路置制使"],
    },
  },
  {
    name: "马伸",
    position: {
      0: ["殿中侍御史"],
      1128010000: ["荆湖北路制置使"],
    },
  },
  {
    name: "杨惟忠",
    position: {
      0: ["北道都总管", "建武军节度使"],
      1128013000: ["总揽殿前司公事", "建武军节度使"],
    },
  },
];

export default characterData;
